Revit 2026 API

# CurveByPointsReferenceType Property

---

Indicates the type of reference.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ReferenceType ReferenceType { get; set; }
```
```vb
Public Property ReferenceType As ReferenceType
	Get
	Set
```
```cpp
public:
property ReferenceType ReferenceType {
	ReferenceType get ();
	void set (ReferenceType value);
}
```
```fsharp
member ReferenceType : ReferenceType with get, set
```

#### Property Value

ReferenceType

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | Thrown when argument is out of range. |
| InvalidOperationException | Thrown when regeneration failed. |

#### Reference

CurveByPoints Class

Autodesk.Revit.DB Namespace